# Day 1

In [1]:
import numpy as np
import pandas as pd

In [13]:
food = pd.read_csv('inputs/day_01_input.txt', header=None, skip_blank_lines=False)

In [14]:
food

            0
0      6758.0
1      5199.0
2     10292.0
3      8812.0
4      3527.0
...       ...
2250   1893.0
2251   5508.0
2252   3414.0
2253   2180.0
2254   4254.0

[2255 rows x 1 columns]

In [30]:
answer = 0
var = 0
for i in food[0].values:
    if np.isnan(i):
        if var > answer:
            answer = var
        var = 0
    else:
        var += i

In [31]:
answer

71506.0

In [32]:
answers = []
var = 0
for i in food[0].values:
    if np.isnan(i):
        answers.append(var)
        var = 0
    else:
        var += i

In [43]:
answers.sort()
sum(answers[-3:])

209603.0

# Dataframe solutions

In [92]:
(food
 .fillna(0)
 .reset_index()
 .rename(columns={'index':'x1', 0:'x2'})
 .assign(
     x3 = lambda x: np.where(x.x2 == 0, x.x1, 0),
     x4 = lambda x: x.x3.cummax()
 )
 .groupby('x4', as_index=False)
 .agg({'x2':'sum'})
 .sort_values('x2', ascending=False)
)

       x4       x2
112   951  71506.0
191  1710  69368.0
133  1109  68729.0
254  2227  68342.0
148  1277  67818.0
..    ...      ...
57    474  16514.0
80    658  15870.0
38    282  11905.0
3      12   6730.0
30    238   6529.0

[256 rows x 2 columns]

In [105]:
df = (food
 .fillna(0)
 .reset_index()
 .rename(columns={'index':'x1', 0:'calories'})
 .assign(
     x1 = lambda x: np.where(x.calories == 0, x.x1, 0),
     elf = lambda x: x.x1.cummax()
 ) 
 .groupby('elf', as_index=False)
 .agg({'calories':'sum'})
 .sort_values('calories', ascending=False)
)

In [106]:
df.max()

elf          2243.0
calories    71506.0
dtype: float64

In [108]:
df.iloc[:3, 1].sum()

209603.0